# PANDAS Lab Exercises

In [7]:
import pandas as pd

# Read the CSV file into a DataFrame
summary = pd.read_csv("C:/Users/Med Botan/Desktop/CMPE SPRNG 2023/MACHINE LEARNING/CPE316_MachineLearning/week2/W3_V5 ApplyNames.csv")

In [8]:
print(summary)

  Emp ID Last Name First Name  Gender       Location  Floor  Annual Salary  \
0  E1001     CAROL        Joe    Male  01-North 2321      1         101400
1  E1003     CHUNG       Eric    Male   03-West 2796      2          70300
2  E1004  FLANDERS     Daniel    Male  02-North 2639      3          68800
3  E1110     BARRY       Adam    Male   02-West 2018      4          59200
4  E1134    FERRIS    Maleary  Female  03-North 2392      5          62900
5  E1150    FILOSA      Susan  Female   02-West 2279      6          58400
6  E1162   CARLTON    Barbara  Female   02-West 2699      7          59200

    Unnamed: 7  Unnamed: 8
0          NaN         NaN
1          NaN         NaN
2          NaN         NaN
3          NaN         NaN
4  $68,600.00          NaN
5          NaN         NaN
6          NaN         NaN

In [9]:
employees= pd.DataFrame(summary)

In [10]:
print(employees)

  Emp ID Last Name First Name  Gender       Location  Floor  Annual Salary  \
0  E1001     CAROL        Joe    Male  01-North 2321      1         101400
1  E1003     CHUNG       Eric    Male   03-West 2796      2          70300
2  E1004  FLANDERS     Daniel    Male  02-North 2639      3          68800
3  E1110     BARRY       Adam    Male   02-West 2018      4          59200
4  E1134    FERRIS    Maleary  Female  03-North 2392      5          62900
5  E1150    FILOSA      Susan  Female   02-West 2279      6          58400
6  E1162   CARLTON    Barbara  Female   02-West 2699      7          59200

    Unnamed: 7  Unnamed: 8
0          NaN         NaN
1          NaN         NaN
2          NaN         NaN
3          NaN         NaN
4  $68,600.00          NaN
5          NaN         NaN
6          NaN         NaN

In [11]:
print(employees.columns)

Index(['Emp ID', 'Last Name', 'First Name', 'Gender', 'Location', 'Floor',
       'Annual Salary', 'Unnamed: 7', 'Unnamed: 8'],
      dtype='object')

In [12]:
print(employees.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Emp ID         7 non-null      object
 1   Last Name      7 non-null      object
 2   First Name     7 non-null      object
 3   Gender         7 non-null      object
 4   Location       7 non-null      object
 5   Floor          7 non-null      int64
 6   Annual Salary  7 non-null      int64
 7   Unnamed: 7     1 non-null      object
 8   Unnamed: 8     0 non-null      float64
dtypes: float64(1), int64(2), object(6)
memory usage: 632.0+ bytes
None

In [13]:
print(employees.dtypes)

Emp ID            object
Last Name         object
First Name        object
Gender            object
Location          object
Floor              int64
Annual Salary      int64
Unnamed: 7        object
Unnamed: 8       float64
dtype: object

In [14]:
print(employees.describe())

          Floor  Annual Salary  Unnamed: 8
count  7.000000       7.000000         0.0
mean   4.000000   68600.000000         NaN
std    2.160247   15231.655633         NaN
min    1.000000   58400.000000         NaN
25%    2.500000   59200.000000         NaN
50%    4.000000   62900.000000         NaN
75%    5.500000   69550.000000         NaN
max    7.000000  101400.000000         NaN

# Indexing And Slicing in PANDAS

In [15]:
print(employees["First Name"])

0        Joe
1       Eric
2     Daniel
3       Adam
4    Maleary
5      Susan
6    Barbara
Name: First Name, dtype: object

In [16]:
print(employees.loc[:, "Location"])  #All Locations

0    01-North 2321
1     03-West 2796
2    02-North 2639
3     02-West 2018
4    03-North 2392
5     02-West 2279
6     02-West 2699
Name: Location, dtype: object

In [17]:
print(employees.loc[:2, "Emp ID"]) #Employer ID's from index 0 to 2

0    E1001
1    E1003
2    E1004
Name: Emp ID, dtype: object

In [18]:
print(employees.loc[:4, ["Emp ID", "First Name", "Annual Salary"]])

  Emp ID First Name  Annual Salary
0  E1001        Joe         101400
1  E1003       Eric          70300
2  E1004     Daniel          68800
3  E1110       Adam          59200
4  E1134    Maleary          62900

In [19]:
print(employees.loc[::-1])  #Reverse The ROWS queue

  Emp ID Last Name First Name  Gender       Location  Floor  Annual Salary  \
6  E1162   CARLTON    Barbara  Female   02-West 2699      7          59200
5  E1150    FILOSA      Susan  Female   02-West 2279      6          58400
4  E1134    FERRIS    Maleary  Female  03-North 2392      5          62900
3  E1110     BARRY       Adam    Male   02-West 2018      4          59200
2  E1004  FLANDERS     Daniel    Male  02-North 2639      3          68800
1  E1003     CHUNG       Eric    Male   03-West 2796      2          70300
0  E1001     CAROL        Joe    Male  01-North 2321      1         101400

    Unnamed: 7  Unnamed: 8
6          NaN         NaN
5          NaN         NaN
4  $68,600.00          NaN
3          NaN         NaN
2          NaN         NaN
1          NaN         NaN
0          NaN         NaN

# Filtering in PANDAS

In [20]:
floor = employees.Floor>4     
employees["bool"]= floor
print(employees.loc[:,["Floor","bool"]])

   Floor   bool
0      1  False
1      2  False
2      3  False
3      4  False
4      5   True
5      6   True
6      7   True

In [21]:
filtered_employees = employees[employees['Annual Salary'] > 60000]

In [22]:
print(filtered_employees.loc[:, "Emp ID"])

0    E1001
1    E1003
2    E1004
4    E1134
Name: Emp ID, dtype: object

In [23]:
import numpy as np
average_salary = employees['Annual Salary'].mean() #pandas ile ortalama bulma 
print(average_salary)

68600.0

In [24]:
employees["Current Salary is"] = ["Less than Average" if employees['Annual Salary'].mean() > each else "More than Average" for each in employees['Annual Salary']]
print(employees.loc[:, ["Emp ID", "Annual Salary", "Current Salary is"]])

  Emp ID  Annual Salary  Current Salary is
0  E1001         101400  More than Average
1  E1003          70300  More than Average
2  E1004          68800  More than Average
3  E1110          59200  Less than Average
4  E1134          62900  Less than Average
5  E1150          58400  Less than Average
6  E1162          59200  Less than Average

# Concatenating in PANDAS

In [25]:
data1 = employees.head()     
data2 = employees.tail()
data_concat = pd.concat([data1,data2],axis=0)
data_concat

,Emp ID,Last Name,First Name,Gender,Location,Floor,Annual Salary,Unnamed: 7,Unnamed: 8,bool,Current Salary is
0,E1001,CAROL,Joe,Male,01-North 2321,1,101400,NaN,NaN,False,More than Average
1,E1003,CHUNG,Eric,Male,03-West 2796,2,70300,NaN,NaN,False,More than Average
2,E1004,FLANDERS,Daniel,Male,02-North 2639,3,68800,NaN,NaN,False,More than Average
3,E1110,BARRY,Adam,Male,02-West 2018,4,59200,NaN,NaN,False,Less than Average
4,E1134,FERRIS,Maleary,Female,03-North 2392,5,62900,"$68,600.00",NaN,True,Less than Average
2,E1004,FLANDERS,Daniel,Male,02-North 2639,3,68800,NaN,NaN,False,More than Average
3,E1110,BARRY,Adam,Male,02-West 2018,4,59200,NaN,NaN,False,Less than Average
4,E1134,FERRIS,Maleary,Female,03-North 2392,5,62900,"$68,600.00",NaN,True,Less than Average
5,E1150,FILOSA,Susan,Female,02-West 2279,6,58400,NaN,NaN,True,Less than Average
6,E1162,CARLTON,Barbara,Female,02-West 2699,7,59200,NaN,NaN,True,Less than Average